import KeyboardKey from "./KeyboardKey";

function VirtualKeyboard({ onKeyPress }) {
  return (
    <div className="flex gap-2">
      <KeyboardKey char="A" onKeyPress={onKeyPress} />
      <KeyboardKey char="B" onKeyPress={onKeyPress} />
      <KeyboardKey char="C" onKeyPress={onKeyPress} />

    </div>
  );
}
export default VirtualKeyboard;

/*
const keyboardLayouts = {
    english: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
      ['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p'],
      ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';'],
      ['z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '?'],
      ['!', '@', '#', '$', '%', '^', '&', '*', '(', ')'],
      [' '] // שורת רווח
    ],
    hebrew: [
      ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
      ['/', '\'', 'ק', 'ר', 'א', 'ט', 'ו', 'ן', 'ם', 'פ'],
      ['ש', 'ד', 'ג', 'כ', 'ע', 'י', 'ח', 'ל', 'ך', 'ף'],
      ['ז', 'ס', 'ב', 'ה', 'נ', 'מ', 'צ', 'ת', 'ץ', '?'],
      ['!', '@', '#', '$', '%', '^', '&', '*', '(', ')'],
      [' '] // שורת רווח
    ],
    emoji: [
      ['😀', '😂', '😊', '😍', '😎', '🤔', '😴', '😳', '😭', '😡'],
      ['👍', '👎', '👌', '✋', '👏', '👋', '👀', '👉', '👈', '💪'],
      ['❤️', '💔', '💖', '💙', '💯', '💤', '💨', '💦', '💫', '⭐'],
      ['🔥', '⚡', '☀️', '🌙', '☁️', '🌈', '🍀', '🌹', '🌸', '🍂'],
      ['🐶', '🐱', '🐭', '🐼', '🐵', '🦁', '🐯', '🦊', '🐻', '🐨'],
      [' '] // שורת רווח
    ]
  };
  

*/